artillery-test/test3000.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://192.168.100.11:3000
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}  # Verifica si se cumplen ciertos umbrales (ej. tiempos de respuesta)
    apdex: {} # Calcula el índice de satisfacción Apdex
    metrics-by-endpoint: {} # Analiza tiempos de respuesta por URL
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 400
      - http.response_time.p95: 300
scenarios:
  - flow:
      - loop:
          - get:
              url: '/'
        count: 100